src/cf/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДебитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДебет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредит</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧКредиторскаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчётов</name>
      <type>
        <types>DefinedType.ОбъектРасчётовОбщий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДебиторскаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчётов</name>
      <type>
        <types>DefinedType.ОбъектРасчётовОбщий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/КорректировкаДолга/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктВзаимозачета";
	Команда.Представление = НСтр("ru = 'Акт взаимозачёта'; fr = 'Acte de compensation';
		|en = 'Act of compensation'; es = 'Acto de compensación'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВзаимозачета") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктаВзаимозачета(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктВзаимозачета",
			НСтр("ru = 'Акт взаимозачёта'; fr = 'Acte de compensation';
			|en = 'Act of compensation'; es = 'Acto de compensación'"),
			Таб, "Документ.КорректировкаДолга.АктВзаимозачета");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьАктаВзаимозачета(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.Автомасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_КорректировкаДолга_АктВзаимозачета";
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.КорректировкаДолга.АктВзаимозачета");
	// Шапка
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.СтрокаШапки = РаботаСДокументами.КраткоеПредставлениеДокумента(Док);
	
	ПредставлениеВалюты = Строка(Константы.ВалютаРегламентированногоУчета.Получить());
	ДебиторскаяЗадолженность = Док.ТЧДебиторскаяЗадолженность.Выгрузить();
	КредиторскаяЗадолженность = Док.ТЧКредиторскаяЗадолженность.Выгрузить();
	ДебиторскаяЗадолженность.Свернуть("ОбъектРасчётов","Сумма");
	ДебиторскаяЗадолженность.Сортировать("ОбъектРасчётов,Сумма");
	КредиторскаяЗадолженность.Свернуть("ОбъектРасчётов","Сумма");
	КредиторскаяЗадолженность.Сортировать("ОбъектРасчётов,Сумма");
	Таб.Вывести(оЗаголовок);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДебиторки");
	//СтрокаДебиторки = НСтр("ru = '2. Задолженность %ПредставлениеДебитора% перед %ПредставлениеОрганизации% составляет "
	СтрокаДебиторки = НСтр("ru = '2. Задолженность %ПредставлениеОрганизации% перед %ПредставлениеДебитора% составляет "
	+ "%Сумма% %ПредставлениеВалюты% по следующим документам/договорам:'");
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеДебитора%", Док.КонтрагентДебитор);
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеОрганизации%", Док.Организация);
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеВалюты%", ПредставлениеВалюты);
	СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%Сумма%", Формат(ДебиторскаяЗадолженность.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль"));
	ОбластьМакета.Параметры.СтрокаДебиторки = СтрокаДебиторки;
	Таб.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДебиторки");
	Для каждого СтрокаЗадолженности Из ДебиторскаяЗадолженность Цикл
		ОбластьМакета.Параметры.СтрокаДокументовДеб = сокрЛП(СтрокаЗадолженности.ОбъектРасчётов) + " :" + Символы.Таб + Формат(СтрокаЗадолженности["Сумма"], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
		Таб.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКредиторки");
	//СтрокаКредиторки = НСтр("fr = '1. Dette %ПредставлениеОрганизации% avant %ПредставлениеКредитора% '; ru = '1. Задолженность %ПредставлениеОрганизации% перед %ПредставлениеКредитора% составляет'; en = '1. The debt owed by %ПредставлениеОрганизации% to %ПредставлениеКредитора% is'; es = '1. La deuda %ПредставлениеОрганизации% a %ПредставлениеКредитора% es'")+ " ";
	СтрокаКредиторки = НСтр("fr = '1. Dette %ПредставлениеКредитора% avant %ПредставлениеОрганизации% '; ru = '1. Задолженность %ПредставлениеКредитора% перед %ПредставлениеОрганизации% составляет'; en = '1. The debt owed by %ПредставлениеКредитора% to %ПредставлениеОрганизации% is'; es = '1. La deuda del %ПредставлениеКредитора% a %ПредставлениеОрганизации% es'")+ " ";
	СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеОрганизации%",Док.Организация);
	СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеКредитора%",Док.КонтрагентКредитор);
	СтрокаКредиторки  = СтрокаКредиторки + Формат(КредиторскаяЗадолженность.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты + " " +НСтр("fr = 'selon les documents/contrats suivants:'; ru = 'по следующим документам/договорам:'; en = 'according to the following documents/agreements:'; es = 'en virtud de los siguientes instrumentos / tratados:'");
	ОбластьМакета.Параметры.СтрокаКредиторки = СтрокаКредиторки;
	Таб.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКредиторки");
	Для каждого СтрокаЗадолженности Из КредиторскаяЗадолженность Цикл
		ОбластьМакета.Параметры.СтрокаДокументовКред = сокрЛП(СтрокаЗадолженности.ОбъектРасчётов) + " :"+ символы.Таб + Формат(СтрокаЗадолженности["Сумма"], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
		Таб.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьПодвала     = Макет.ПолучитьОбласть("Подвал");
	СтрокаВзаимозачета = НСтр("fr = '3. La compensation est effectuée sur le montant'; ru = '3. Взаимозачет производится на сумму'; en = '3. Offsetting is performed for the amount of'; es = '3. La compensación se efectúa por la suma'")+ " "
	+ Формат(КредиторскаяЗадолженность.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
	ОбластьПодвала.Параметры.СтрокаВзаимозачета       = СтрокаВзаимозачета;
	ОбластьПодвала.Параметры.ПредставлениеОрганизации = Док.Организация;
	ОбластьПодвала.Параметры.ПредставлениеКредитора   = Док.КонтрагентДебитор;
	Таб.Вывести(ОбластьПодвала);
КонецПроцедуры

#КонецОбласти
